app/controllers/settings_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = '--- :current_user\n')
---
  def index
		@user = User.find(current_user)