app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
	def index
		@users = User.find(:all)

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
	def show
		@user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
	def edit
		@user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `email` = 'ognevsky@gmail.ru', `updated_at` = '2009-03-29 16:42:06' WHERE `id` = 1
---
	def update
		@user = User.find(params[:id])

		if @user.update_attributes(params[:user])

INSERT INTO `users` (`name`, `salt`, `avatar_updated_at`, `updated_at`, `avatar_file_name`, `avatar_file_size`, `crypted_password`, `remember_token_expires_at`, `avatar_content_type`, `remember_token`, `login`, `email`, `created_at`) VALUES('', '12fe49548977fc2aff602cc2bbffc1da72291bb6', NULL, '2009-03-29 13:06:17', NULL, NULL, '73539168fae4342514ebd71e03ef85aed5631697', NULL, NULL, NULL, 'admin', 'admin@admin.com', '2009-03-29 13:06:17')
---
	def create
		logout_keeping_session!
		@user = User.new(params[:user])
		success = @user && @user.save